# YOLO11-Drone-P2 (Dynamic Fusion + Mamba + P2 Micro Head)
nc: 15
ch: 4

backbone:
  # [from, repeats, module, args]
  - [-1, 1, DynamicSpatialFusion, [64]]  # 0-P1/2
  - [-1, 1, Conv, [128, 3, 2]]           # 1-P2/4  (160x160)
  - [-1, 2, C3k2, [256, False, 0.25]]    # 2
  - [-1, 1, Conv, [256, 3, 2]]           # 3-P3/8  (80x80)
  - [-1, 2, C3k2, [512, False, 0.25]]    # 4
  - [-1, 2, C2f_Mamba, [512, True]]      # 5 (Mamba 增强语义)
  - [-1, 1, Conv, [512, 3, 2]]           # 6-P4/16 (40x40)
  - [-1, 2, C2f_Mamba, [512, True]]      # 7 (深层 Mamba)
  # 注意：去掉了原来的 P5 (32倍下采样) 和深层 SPPF

head:
  # === 自顶向下 (Top-Down) ===
  - [-1, 1, nn.Upsample, [None, 2, 'nearest']] # 8
  - [[-1, 5], 1, Concat, [1]]                  # 9 cat P3
  - [-1, 2, C3k2, [256, False]]                # 10

  - [-1, 1, nn.Upsample, [None, 2, 'nearest']] # 11
  - [[-1, 2], 1, Concat, [1]]                  # 12 cat P2
  - [-1, 2, C3k2, [128, False]]                # 13 (P2 Head Output)

  # === 自底向上 (Bottom-Up) ===
  - [-1, 1, Conv, [128, 3, 2]]                 # 14
  - [[-1, 10], 1, Concat, [1]]                 # 15 cat P3
  - [-1, 2, C3k2, [256, False]]                # 16 (P3 Head Output)

  - [-1, 1, Conv, [256, 3, 2]]                 # 17
  - [[-1, 7], 1, Concat, [1]]                  # 18 cat P4
  - [-1, 2, C3k2, [512, False]]                # 19 (P4 Head Output)

  # 检测头连接：P2(极小), P3(小), P4(中)
  - [[13, 16, 19], 1, Detect, [nc]]            # 20