# yolo11-slim-mamba-obb.yaml

nc: 5
ch: 4

scales:
  slim: [1.0, 1.0, 1024] # Base scale, no shrinking applied globally, we manually scaled the channels

backbone:
  # [from, repeats, module, args]
  - [-1, 1, nn.Identity, []] # 0

  # === RGB Branch (Slimmed: 64->48, 128->96, etc.) ===
  - [0, 1, ExtractRGB, [48, 3, 2]]      # 1-P1/2
  - [-1, 1, Conv, [96, 3, 2]]           # 2-P2/4 (Standard Conv for shallow)
  - [-1, 2, C3k2, [96, False, 0.25]]    # 3
  
  - [-1, 1, Conv, [192, 3, 2]]          # 4-P3/8 (Standard Conv for shallow)
  - [-1, 2, C3k2, [192, False, 0.25]]   # 5
  
  # [SPD-Conv Insertion]: P3(80x80)->P4(40x40) Use SPD
  - [-1, 1, SPDConv, [384]]             # 6-P4/16 (SPDConv, out=384)
  - [-1, 2, C3k2, [384, False, 0.25]]   # 7

  # === IR Branch (Symmetrical) ===
  - [0, 1, ExtractIR, [48, 3, 2]]       # 8
  - [-1, 1, Conv, [96, 3, 2]]           # 9
  - [-1, 2, C3k2, [96, False, 0.25]]    # 10
  
  - [-1, 1, Conv, [192, 3, 2]]          # 11
  - [-1, 2, C3k2, [192, False, 0.25]]   # 12
  
  # [SPD-Conv Insertion]
  - [-1, 1, SPDConv, [384]]             # 13
  - [-1, 2, C3k2, [384, False, 0.25]]   # 14

  # === IAGA Fusion (Slimmed Channels) ===
  - [[3, 10], 1, Spatial_IAGA_Module, [96]]    # 15: P2
  - [[5, 12], 1, Spatial_IAGA_Module, [192]]   # 16: P3
  - [[7, 14], 1, Spatial_IAGA_Module, [384]]   # 17: P4

  # === Neck (Reduced One Mamba) ===
  # [Slimming]: REMOVED old Layer 18 (P3 Mamba)
  # Only KEEP P4 Mamba (Now Layer 18)
  - [17, 2, C2f_Mamba, [384, True]]            # 18: P4 Global Context

head:
  # PAFPN with Index Correction
  - [-1, 1, nn.Upsample, [None, 2, 'nearest']] # 19: Up P4
  - [[-1, 16], 1, Concat, [1]]                 # 20: Concat with P3 (Layer 16) NO MAMBA
  - [-1, 2, C3k2, [192, False]]                # 21

  - [-1, 1, nn.Upsample, [None, 2, 'nearest']] # 22
  - [[-1, 15], 1, Concat, [1]]                 # 23: Concat with P2 (Layer 15)
  - [-1, 2, C3k2, [96, False]]                 # 24 (P2 Out)

  - [-1, 1, Conv, [96, 3, 2]]                  # 25
  - [[-1, 21], 1, Concat, [1]]                 # 26
  - [-1, 2, C3k2, [192, False]]                # 27 (P3 Out)

  - [-1, 1, Conv, [192, 3, 2]]                 # 28
  - [[-1, 18], 1, Concat, [1]]                 # 29: Connect to Layer 18 (P4 Mamba)
  - [-1, 2, C3k2, [384, False]]                # 30 (P4 Out)

  # Detect
  - [[24, 27, 30], 1, OBB, [nc, 1]]            # 31