
nc: 5  # 类别数 
ch: 4  # 假设输入 DataLoader 组装好的张量为 4 通道 (0-2: RGB, 3: IR)

backbone:
  # [from, repeats, module, args]
  
  # === 第 0 层：输入占位符（YOLO 分流黑科技） ===
  - [-1, 1, nn.Identity, []]  # 0: 保存原始 4 通道图像，供双分支调用

  # ================= RGB 主干分支 =================
  - [0, 1, ExtractRGB, [64, 3, 2]]       # 1-P1/2 (提取 0~2 通道，并做降采样)
  - [-1, 1, Conv, [128, 3, 2]]           # 2-P2/4 (160x160)
  - [-1, 2, C3k2, [128, False, 0.25]]    # 3: RGB 的 P2 特征
  
  - [-1, 1, Conv, [256, 3, 2]]           # 4-P3/8 (80x80)
  - [-1, 2, C3k2, [256, False, 0.25]]    # 5: RGB 的 P3 特征
  
  - [-1, 1, Conv, [512, 3, 2]]           # 6-P4/16 (40x40)
  - [-1, 2, C3k2, [512, False, 0.25]]    # 7: RGB 的 P4 特征

  # ================= IR 主干分支 =================
  - [0, 1, ExtractIR, [64, 3, 2]]        # 8-P1/2 (提取第 3 通道，并做降采样)
  - [-1, 1, Conv, [128, 3, 2]]           # 9-P2/4 (160x160)
  - [-1, 2, C3k2, [128, False, 0.25]]    # 10: IR 的 P2 特征
  
  - [-1, 1, Conv, [256, 3, 2]]           # 11-P3/8 (80x80)
  - [-1, 2, C3k2, [256, False, 0.25]]    # 12: IR 的 P3 特征
  
  - [-1, 1, Conv, [512, 3, 2]]           # 13-P4/16 (40x40)
  - [-1, 2, C3k2, [512, False, 0.25]]    # 14: IR 的 P4 特征

  # ================= IAGA 中期特征门控融合 =================
  - [[3, 10], 1, Spatial_IAGA_Module, [128]]     # 15: 融合 P2 层特征 (RGB+IR)
  - [[5, 12], 1, Spatial_IAGA_Module, [256]]     # 16: 融合 P3 层特征 (RGB+IR)
  - [[7, 14], 1, Spatial_IAGA_Module, [512]]     # 17: 融合 P4 层特征 (RGB+IR)

  # ================= 融合后的语义增强 (保留你的巧妙设计) =================
  - [16, 2, C2f_Mamba, [256, True]]      # 18: 对融合后的 P3 进行全局感知
  - [17, 2, C2f_Mamba, [512, True]]      # 19: 对融合后的 P4 进行全局感知

head:
  # === 自顶向下 (Top-Down) PAFPN ===
  - [-1, 1, nn.Upsample, [None, 2, 'nearest']] # 20: 上采样 P4 (来自 Mamba)
  - [[-1, 18], 1, Concat, [1]]                 # 21: 拼接 Mamba_P3
  - [-1, 2, C3k2, [256, False]]                # 22

  - [-1, 1, nn.Upsample, [None, 2, 'nearest']] # 23: 上采样 P3
  - [[-1, 15], 1, Concat, [1]]                 # 24: 拼接 Fused_P2
  - [-1, 2, C3k2, [128, False]]                # 25 (P2 Head Output)

  # === 自底向上 (Bottom-Up) PAFPN ===
  - [-1, 1, Conv, [128, 3, 2]]                 # 26: 下采样 P2
  - [[-1, 22], 1, Concat, [1]]                 # 27: 拼接 P3
  - [-1, 2, C3k2, [256, False]]                # 28 (P3 Head Output)

  - [-1, 1, Conv, [256, 3, 2]]                 # 29: 下采样 P3
  - [[-1, 19], 1, Concat, [1]]                 # 30: 拼接 P4 (来自 Mamba)
  - [-1, 2, C3k2, [512, False]]                # 31 (P4 Head Output)

  # ================= 旋转框检测头 (核心修改) =================
  # 将 Detect 替换为 OBB，解决水平框 NMS 误杀问题
  - [[25, 28, 31], 1, OBB, [nc,1]]               # 32